# OpenBuildingComponentDocument Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
Application..::..OpenBuildingComponentDocument Method
Application Class See Also
---
Opens a Building Component document from disk.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public virtual Document OpenBuildingComponentDocument(
	string fileName
)
```

Visual Basic
---
```text
Public Overridable Function OpenBuildingComponentDocument ( _
	fileName As String _
) As Document
```

Visual C++
---
```text
public:
virtual Document^ OpenBuildingComponentDocument(
	String^ fileName
)
```

# ### Parameters
fileName
    Type: System..::..StringThe Building Component file to be opened.
# Remarks
The opened document is a family document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | If nullNothingnullptra null reference (Nothing in Visual Basic) is passed as 'fileName'. |
| Autodesk.Revit.Exceptions..::..ArgumentException | If 'fileName' is an empty string or it is not an Autodesk Exchange file name. |
| Autodesk.Revit.Exceptions..::..FileArgumentNotFoundException | If the file specified by 'fileName' cannot be found. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If the Building Component file cannot be opened. |

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace